LR/app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
        def index
          @workouts = Workout.all

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1 AND "workouts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
        def show
          @user_buy_current_workout = user_signed_in? && current_user.workouts.where(id: params[:id]).any?
          @workout = Workout.find(params[:id])

INSERT INTO "workouts" ("title", "descriprtion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "123131"], ["descriprtion", "141341"], ["created_at", "2024-03-19 13:35:27.689375"], ["updated_at", "2024-03-19 13:35:27.689375"]]
---
        def create
          @workout = Workout.new(workout_params)

          respond_to do |format|
            if @workout.save